benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-1-20.log
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.773ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.776ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.78ms    1.11ms   7.81ms   96.08%
    Req/Sec    11.59     34.63   111.00     89.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.56ms
 75.000%    1.71ms
 90.000%    1.96ms
 99.000%    7.81ms
 99.900%   13.22ms
 99.990%   13.22ms
 99.999%   13.22ms
100.000%   13.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.245     0.000000            1         1.00
       1.364     0.100000           44         1.11
       1.418     0.200000           88         1.25
       1.461     0.300000          131         1.43
       1.511     0.400000          175         1.67
       1.557     0.500000          217         2.00
       1.573     0.550000          239         2.22
       1.596     0.600000          261         2.50
       1.631     0.650000          283         2.86
       1.676     0.700000          304         3.33
       1.712     0.750000          326         4.00
       1.731     0.775000          337         4.44
       1.762     0.800000          348         5.00
       1.797     0.825000          359         5.71
       1.854     0.850000          369         6.67
       1.900     0.875000          380         8.00
       1.937     0.887500          386         8.89
       1.960     0.900000          391        10.00
       2.005     0.912500          397        11.43
       2.049     0.925000          402        13.33
       2.195     0.937500          407        16.00
       2.237     0.943750          410        17.78
       2.537     0.950000          413        20.00
       2.661     0.956250          416        22.86
       3.013     0.962500          418        26.67
       3.347     0.968750          421        32.00
       3.475     0.971875          422        35.56
       4.211     0.975000          424        40.00
       4.251     0.978125          425        45.71
       6.399     0.981250          426        53.33
       7.499     0.984375          428        64.00
       7.499     0.985938          428        71.11
       7.679     0.987500          429        80.00
       7.807     0.989062          430        91.43
       7.807     0.990625          430       106.67
       9.039     0.992188          431       128.00
       9.039     0.992969          431       142.22
       9.319     0.993750          432       160.00
       9.319     0.994531          432       182.86
       9.319     0.995313          432       213.33
      10.479     0.996094          433       256.00
      10.479     0.996484          433       284.44
      10.479     0.996875          433       320.00
      10.479     0.997266          433       365.71
      10.479     0.997656          433       426.67
      13.223     0.998047          434       512.00
      13.223     1.000000          434          inf
#[Mean    =        1.776, StdDeviation   =        1.113]
#[Max     =       13.216, Total count    =          434]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  651 requests in 30.01s, 126.51KB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:     21.69
Transfer/sec:      4.22KB