benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-1-200.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.430ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.47ms    1.30ms   8.47ms   95.11%
    Req/Sec   104.18    106.95   444.00     83.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.34ms
 90.000%    1.69ms
 99.000%    8.47ms
 99.900%   14.94ms
 99.990%   18.86ms
 99.999%   20.85ms
100.000%   20.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.931     0.000000            2         1.00
       1.029     0.100000         1017         1.11
       1.060     0.200000         1989         1.25
       1.092     0.300000         2983         1.43
       1.128     0.400000         3970         1.67
       1.166     0.500000         4965         2.00
       1.190     0.550000         5467         2.22
       1.217     0.600000         5951         2.50
       1.250     0.650000         6447         2.86
       1.291     0.700000         6934         3.33
       1.339     0.750000         7431         4.00
       1.367     0.775000         7674         4.44
       1.397     0.800000         7925         5.00
       1.437     0.825000         8171         5.71
       1.486     0.850000         8417         6.67
       1.557     0.875000         8667         8.00
       1.612     0.887500         8791         8.89
       1.690     0.900000         8911        10.00
       1.824     0.912500         9035        11.43
       2.007     0.925000         9160        13.33
       2.267     0.937500         9284        16.00
       2.473     0.943750         9345        17.78
       2.715     0.950000         9406        20.00
       3.067     0.956250         9469        22.86
       3.555     0.962500         9530        26.67
       4.081     0.968750         9592        32.00
       4.491     0.971875         9623        35.56
       4.935     0.975000         9654        40.00
       5.403     0.978125         9685        45.71
       6.099     0.981250         9716        53.33
       7.023     0.984375         9747        64.00
       7.347     0.985938         9762        71.11
       7.759     0.987500         9778        80.00
       8.155     0.989062         9793        91.43
       8.599     0.990625         9810       106.67
       9.103     0.992188         9824       128.00
       9.287     0.992969         9832       142.22
       9.735     0.993750         9840       160.00
      10.199     0.994531         9848       182.86
      10.631     0.995313         9855       213.33
      11.119     0.996094         9863       256.00
      11.495     0.996484         9867       284.44
      11.799     0.996875         9871       320.00
      12.231     0.997266         9874       365.71
      12.839     0.997656         9878       426.67
      13.495     0.998047         9882       512.00
      14.159     0.998242         9884       568.89
      14.327     0.998437         9886       640.00
      14.519     0.998633         9888       731.43
      14.791     0.998828         9890       853.33
      15.935     0.999023         9892      1024.00
      16.079     0.999121         9893      1137.78
      16.351     0.999219         9894      1280.00
      16.527     0.999316         9895      1462.86
      16.751     0.999414         9896      1706.67
      17.887     0.999512         9897      2048.00
      17.887     0.999561         9897      2275.56
      17.951     0.999609         9898      2560.00
      17.951     0.999658         9898      2925.71
      18.655     0.999707         9899      3413.33
      18.655     0.999756         9899      4096.00
      18.655     0.999780         9899      4551.11
      18.863     0.999805         9900      5120.00
      18.863     0.999829         9900      5851.43
      18.863     0.999854         9900      6826.67
      18.863     0.999878         9900      8192.00
      18.863     0.999890         9900      9102.22
      20.847     0.999902         9901     10240.00
      20.847     1.000000         9901          inf
#[Mean    =        1.472, StdDeviation   =        1.299]
#[Max     =       20.832, Total count    =         9901]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11726 requests in 1.00m, 2.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:    195.35
Transfer/sec:     37.96KB