benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/experiment-1-80.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.450ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.516ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.49ms    1.16ms   7.78ms   96.26%
    Req/Sec    41.81     67.38   222.00     82.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.26ms
 75.000%    1.41ms
 90.000%    1.66ms
 99.000%    7.78ms
 99.900%   14.81ms
 99.990%   21.60ms
 99.999%   21.60ms
100.000%   21.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.977     0.000000            1         1.00
       1.105     0.100000          408         1.11
       1.148     0.200000          802         1.25
       1.183     0.300000         1191         1.43
       1.220     0.400000         1594         1.67
       1.262     0.500000         1981         2.00
       1.288     0.550000         2182         2.22
       1.313     0.600000         2380         2.50
       1.342     0.650000         2578         2.86
       1.375     0.700000         2776         3.33
       1.414     0.750000         2973         4.00
       1.442     0.775000         3070         4.44
       1.470     0.800000         3174         5.00
       1.496     0.825000         3268         5.71
       1.538     0.850000         3368         6.67
       1.593     0.875000         3466         8.00
       1.619     0.887500         3516         8.89
       1.663     0.900000         3565        10.00
       1.708     0.912500         3615        11.43
       1.762     0.925000         3664        13.33
       1.907     0.937500         3714        16.00
       2.021     0.943750         3739        17.78
       2.209     0.950000         3763        20.00
       2.385     0.956250         3788        22.86
       2.649     0.962500         3813        26.67
       3.201     0.968750         3838        32.00
       3.525     0.971875         3850        35.56
       3.901     0.975000         3862        40.00
       4.519     0.978125         3875        45.71
       5.235     0.981250         3887        53.33
       6.119     0.984375         3900        64.00
       6.559     0.985938         3906        71.11
       6.771     0.987500         3912        80.00
       7.255     0.989062         3918        91.43
       7.899     0.990625         3924       106.67
       8.199     0.992188         3931       128.00
       8.519     0.992969         3934       142.22
       8.983     0.993750         3937       160.00
       9.375     0.994531         3940       182.86
       9.831     0.995313         3943       213.33
      10.303     0.996094         3946       256.00
      10.599     0.996484         3948       284.44
      10.823     0.996875         3949       320.00
      11.431     0.997266         3951       365.71
      11.615     0.997656         3952       426.67
      13.287     0.998047         3954       512.00
      13.567     0.998242         3955       568.89
      13.567     0.998437         3955       640.00
      13.679     0.998633         3956       731.43
      14.807     0.998828         3957       853.33
      16.511     0.999023         3958      1024.00
      16.511     0.999121         3958      1137.78
      16.511     0.999219         3958      1280.00
      17.455     0.999316         3959      1462.86
      17.455     0.999414         3959      1706.67
      18.783     0.999512         3960      2048.00
      18.783     0.999561         3960      2275.56
      18.783     0.999609         3960      2560.00
      18.783     0.999658         3960      2925.71
      18.783     0.999707         3960      3413.33
      21.599     0.999756         3961      4096.00
      21.599     1.000000         3961          inf
#[Mean    =        1.493, StdDeviation   =        1.163]
#[Max     =       21.584, Total count    =         3961]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4790 requests in 1.00m, 0.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:     79.80
Transfer/sec:     15.51KB